;******************************************************************************
;* PRU C/C++ Codegen                                              Unix v2.1.1 *
;* Date/Time created: Thu Nov 12 19:18:39 2015                                *
;******************************************************************************
	.compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_version=3 --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("pru_main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.1 Copyright (c) 2012-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/debian/cyclops/Cyclops-PRU/C lib/examples/time_sync")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external
$C$DW$3	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$3, DW_AT_type(*$C$DW$T$11)
	.dwendtag $C$DW$2


$C$DW$4	.dwtag  DW_TAG_subprogram, DW_AT_name("memset")
	.dwattr $C$DW$4, DW_AT_TI_symbol_name("memset")
	.dwattr $C$DW$4, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$4, DW_AT_declaration
	.dwattr $C$DW$4, DW_AT_external

	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/stdint.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x1c)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)

$C$DW$T$32	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
$C$DW$213	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$31)
	.dwendtag $C$DW$T$32

$C$DW$T$33	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$33, DW_AT_address_class(0x10)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/string.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x19)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$26, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/stdint.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x1c)

$C$DW$T$36	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x400)
$C$DW$214	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$214, DW_AT_upper_bound(0xff)
	.dwendtag $C$DW$T$36

$C$DW$T$72	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$72, DW_AT_address_class(0x20)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("u32")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x14)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x12)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$29, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/stdint.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x21)
$C$DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("s64")
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$31, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x12)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$19, DW_AT_decl_file("/usr/share/ti/cgt-pru/include/stdint.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x20)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("u64")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x13)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x12)
$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x20)
$C$DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("cycle_t")
	.dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$21, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x0d)

$C$DW$T$24	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
$C$DW$215	.dwtag  DW_TAG_formal_parameter
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
	.dwendtag $C$DW$T$24

$C$DW$T$25	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$25, DW_AT_address_class(0x10)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("cyclecounter")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x12)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$216, DW_AT_name("read")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("read")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x19)
	.dwattr $C$DW$216, DW_AT_decl_column(0x0f)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$217, DW_AT_name("mask")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("mask")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$217, DW_AT_decl_column(0x0d)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$218, DW_AT_name("mult")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("mult")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$218, DW_AT_decl_column(0x09)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$219, DW_AT_name("shift")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("shift")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$219, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x17)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
$C$DW$T$22	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$28)
$C$DW$T$23	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_address_class(0x20)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_name("iep_time")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x14)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$220, DW_AT_name("ts_ns")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("ts_ns")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("../../include/nesl_pru_iep.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x16)
	.dwattr $C$DW$220, DW_AT_decl_column(0x0e)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$221, DW_AT_name("last_iep_cnt")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("last_iep_cnt")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("../../include/nesl_pru_iep.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x17)
	.dwattr $C$DW$221, DW_AT_decl_column(0x0e)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$222, DW_AT_name("offset")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("offset")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("../../include/nesl_pru_iep.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x18)
	.dwattr $C$DW$222, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("../../include/nesl_pru_iep.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x08)
$C$DW$T$46	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$46, DW_AT_address_class(0x20)

$C$DW$T$57	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$57, DW_AT_name("pru_pin")
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
$C$DW$223	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_20"), DW_AT_const_value(0x2000)
	.dwattr $C$DW$223, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$223, DW_AT_decl_column(0x05)
$C$DW$224	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_21"), DW_AT_const_value(0x1000)
	.dwattr $C$DW$224, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$224, DW_AT_decl_column(0x05)
$C$DW$225	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_27"), DW_AT_const_value(0x100)
	.dwattr $C$DW$225, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x20)
	.dwattr $C$DW$225, DW_AT_decl_column(0x05)
$C$DW$226	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_28"), DW_AT_const_value(0x400)
	.dwattr $C$DW$226, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x21)
	.dwattr $C$DW$226, DW_AT_decl_column(0x05)
$C$DW$227	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_29"), DW_AT_const_value(0x200)
	.dwattr $C$DW$227, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x22)
	.dwattr $C$DW$227, DW_AT_decl_column(0x05)
$C$DW$228	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_39"), DW_AT_const_value(0x40)
	.dwattr $C$DW$228, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x23)
	.dwattr $C$DW$228, DW_AT_decl_column(0x05)
$C$DW$229	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_40"), DW_AT_const_value(0x80)
	.dwattr $C$DW$229, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x24)
	.dwattr $C$DW$229, DW_AT_decl_column(0x05)
$C$DW$230	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_41"), DW_AT_const_value(0x10)
	.dwattr $C$DW$230, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x25)
	.dwattr $C$DW$230, DW_AT_decl_column(0x05)
$C$DW$231	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_42"), DW_AT_const_value(0x20)
	.dwattr $C$DW$231, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x26)
	.dwattr $C$DW$231, DW_AT_decl_column(0x05)
$C$DW$232	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_43"), DW_AT_const_value(0x04)
	.dwattr $C$DW$232, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x27)
	.dwattr $C$DW$232, DW_AT_decl_column(0x05)
$C$DW$233	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_44"), DW_AT_const_value(0x08)
	.dwattr $C$DW$233, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x28)
	.dwattr $C$DW$233, DW_AT_decl_column(0x05)
$C$DW$234	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_45"), DW_AT_const_value(0x01)
	.dwattr $C$DW$234, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x29)
	.dwattr $C$DW$234, DW_AT_decl_column(0x05)
$C$DW$235	.dwtag  DW_TAG_enumerator, DW_AT_name("P8_46"), DW_AT_const_value(0x02)
	.dwattr $C$DW$235, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$235, DW_AT_decl_column(0x05)
$C$DW$236	.dwtag  DW_TAG_enumerator, DW_AT_name("P9_26"), DW_AT_const_value(0x10000)
	.dwattr $C$DW$236, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$236, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$57

	.dwattr $C$DW$T$57, DW_AT_decl_file("../../include/nesl_pru_gpio.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x0a)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x06)

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_name("pru_time")
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x38)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$237, DW_AT_name("tc")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("tc")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$237, DW_AT_decl_column(0x18)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$238, DW_AT_name("cc")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("cc")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$238, DW_AT_decl_column(0x19)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$239, DW_AT_name("slew_cc")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("slew_cc")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$239, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x28)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x08)
$C$DW$T$65	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$65, DW_AT_address_class(0x20)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("rbuffer")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x404)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$240, DW_AT_name("c")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("c")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("../../include/nesl_pru_rbuffer.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x14)
	.dwattr $C$DW$240, DW_AT_decl_column(0x0e)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$241, DW_AT_name("p")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("p")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("../../include/nesl_pru_rbuffer.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x15)
	.dwattr $C$DW$241, DW_AT_decl_column(0x0e)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$242, DW_AT_name("buffer")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("buffer")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("../../include/nesl_pru_rbuffer.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x16)
	.dwattr $C$DW$242, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("../../include/nesl_pru_rbuffer.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x12)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x08)
$C$DW$T$49	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$49, DW_AT_address_class(0x20)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name("timecounter")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x24)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$243, DW_AT_name("cc")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("cc")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x21)
	.dwattr $C$DW$243, DW_AT_decl_column(0x20)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$244, DW_AT_name("cycle_last")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("cycle_last")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x22)
	.dwattr $C$DW$244, DW_AT_decl_column(0x0d)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$245, DW_AT_name("nsec")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("nsec")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x23)
	.dwattr $C$DW$245, DW_AT_decl_column(0x09)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$246, DW_AT_name("mask")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("mask")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x24)
	.dwattr $C$DW$246, DW_AT_decl_column(0x09)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$247, DW_AT_name("frac")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("frac")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x25)
	.dwattr $C$DW$247, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$38

	.dwattr $C$DW$T$38, DW_AT_decl_file("../../include/nesl_pru_time.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)
	.dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

$C$DW$CIE	.dwcie 14
	.dwcfi	cfa_register, 8
	.dwcfi	cfa_offset, 0
	.dwcfi	undefined, 0
	.dwcfi	undefined, 1
	.dwcfi	undefined, 2
	.dwcfi	undefined, 3
	.dwcfi	undefined, 4
	.dwcfi	undefined, 5
	.dwcfi	undefined, 6
	.dwcfi	undefined, 7
	.dwcfi	same_value, 8
	.dwcfi	same_value, 9
	.dwcfi	same_value, 10
	.dwcfi	same_value, 11
	.dwcfi	undefined, 12
	.dwcfi	undefined, 13
	.dwcfi	undefined, 14
	.dwcfi	undefined, 15
	.dwcfi	same_value, 16
	.dwcfi	same_value, 17
	.dwcfi	same_value, 18
	.dwcfi	same_value, 19
	.dwcfi	same_value, 20
	.dwcfi	same_value, 21
	.dwcfi	same_value, 22
	.dwcfi	same_value, 23
	.dwcfi	same_value, 24
	.dwcfi	same_value, 25
	.dwcfi	same_value, 26
	.dwcfi	same_value, 27
	.dwcfi	same_value, 28
	.dwcfi	same_value, 29
	.dwcfi	same_value, 30
	.dwcfi	same_value, 31
	.dwcfi	same_value, 32
	.dwcfi	same_value, 33
	.dwcfi	same_value, 34
	.dwcfi	same_value, 35
	.dwcfi	same_value, 36
	.dwcfi	same_value, 37
	.dwcfi	same_value, 38
	.dwcfi	same_value, 39
	.dwcfi	same_value, 40
	.dwcfi	same_value, 41
	.dwcfi	same_value, 42
	.dwcfi	same_value, 43
	.dwcfi	same_value, 44
	.dwcfi	same_value, 45
	.dwcfi	same_value, 46
	.dwcfi	same_value, 47
	.dwcfi	same_value, 48
	.dwcfi	same_value, 49
	.dwcfi	same_value, 50
	.dwcfi	same_value, 51
	.dwcfi	same_value, 52
	.dwcfi	same_value, 53
	.dwcfi	same_value, 54
	.dwcfi	same_value, 55
	.dwcfi	undefined, 56
	.dwcfi	undefined, 57
	.dwcfi	undefined, 58
	.dwcfi	undefined, 59
	.dwcfi	undefined, 60
	.dwcfi	undefined, 61
	.dwcfi	undefined, 62
	.dwcfi	undefined, 63
	.dwcfi	undefined, 64
	.dwcfi	undefined, 65
	.dwcfi	undefined, 66
	.dwcfi	undefined, 67
	.dwcfi	undefined, 68
	.dwcfi	undefined, 69
	.dwcfi	undefined, 70
	.dwcfi	undefined, 71
	.dwcfi	undefined, 72
	.dwcfi	undefined, 73
	.dwcfi	undefined, 74
	.dwcfi	undefined, 75
	.dwcfi	undefined, 76
	.dwcfi	undefined, 77
	.dwcfi	undefined, 78
	.dwcfi	undefined, 79
	.dwcfi	undefined, 80
	.dwcfi	undefined, 81
	.dwcfi	undefined, 82
	.dwcfi	undefined, 83
	.dwcfi	undefined, 84
	.dwcfi	undefined, 85
	.dwcfi	undefined, 86
	.dwcfi	undefined, 87
	.dwcfi	undefined, 88
	.dwcfi	undefined, 89
	.dwcfi	undefined, 90
	.dwcfi	undefined, 91
	.dwcfi	undefined, 92
	.dwcfi	undefined, 93
	.dwcfi	undefined, 94
	.dwcfi	undefined, 95
	.dwcfi	undefined, 96
	.dwcfi	undefined, 97
	.dwcfi	undefined, 98
	.dwcfi	undefined, 99
	.dwcfi	undefined, 100
	.dwcfi	undefined, 101
	.dwcfi	undefined, 102
	.dwcfi	undefined, 103
	.dwcfi	undefined, 104
	.dwcfi	undefined, 105
	.dwcfi	undefined, 106
	.dwcfi	undefined, 107
	.dwcfi	undefined, 108
	.dwcfi	undefined, 109
	.dwcfi	undefined, 110
	.dwcfi	undefined, 111
	.dwcfi	undefined, 112
	.dwcfi	undefined, 113
	.dwcfi	undefined, 114
	.dwcfi	undefined, 115
	.dwcfi	undefined, 116
	.dwcfi	undefined, 117
	.dwcfi	undefined, 118
	.dwcfi	undefined, 119
	.dwcfi	undefined, 120
	.dwcfi	undefined, 121
	.dwcfi	undefined, 122
	.dwcfi	undefined, 123
	.dwcfi	undefined, 124
	.dwcfi	undefined, 125
	.dwcfi	undefined, 126
	.dwcfi	undefined, 127
	.dwcfi	undefined, 128
	.dwcfi	undefined, 129
	.dwcfi	undefined, 130
	.dwcfi	undefined, 131
	.dwcfi	undefined, 132
	.dwcfi	undefined, 133
	.dwendentry

;***************************************************************
